#include <stdio.h>
#include <stdlib.h>
#include<locale.h>

int main()
{
    setlocale(LC_ALL,"Russian");
    int q;
    char a[10][80]= {"","один","два","три","четыре","пять","шесть","семь","восемь","девять"};
    char b[10][80]= {"десять","один","две","три","четыр","пят","шест","сем","восем","девят"};
    char c[10][80]= {"","","двадцать ","тридцать ","сорок ","пятьдесят ","шестьдесят ","семьдесят ","восемьдесят ","девяносто "};
    scanf("%d",&q);
    if (q==100)
        printf("Сто");
    else if(q/10>1)
    {
        printf("%s%s",c[q/10],a[q%10]);
    }else

        if (q==10)
            printf(b[0]);
        else
            printf("%sнадцать", b[q%10]);
    }




