#include <stdio.h>
#include <stdlib.h>
#include<locale.h>
int main()
{
    setlocale(LC_ALL,"Russian");
    int q;
    char ones[10][80]= {"","один","два","три","четыре","пять","шесть","семь","восемь","девять"};
    char tenths[10][80]= {"десять","одиннадцать","двенадцать","тринадцать","четырнадцать","пятнадцать","шестнадцать","семнадцать","восемнадцать","девятнадцать"};
    char tens[10][80]= {"","","двадцать ","тридцать ","сорок ","пятьдесят ","шестьдесят ","семьдесят ","восемьдесят ","девяносто "};
    scanf("%d",&q);
    if (q==100) // если введённое число 10
    {
        printf("Сто");
        return 0;
    } //выводится сто;
    if(q/10!=1) //если введённое число не 100 и не [10..19]
    {
        printf("%s%s",tens[q/10],ones[q%10]);
        return 0;//выводятся название разряда десятков, а также единиц
    }
    printf("%s",tenths[q%10]); //если число >=10 и <=19 выводится число
}
